WORK_Q = {'Легкая': [('Решите уравнение (если корней несколько, запишите их сумму): x^2-2x+4 = 2x',
                      '2'),
                     ('Решите уравнение (если корней несколько, запишите их сумму): √x = 9', '81'),
                     ('Решите уравнение (если корней несколько, запишите их сумму): 6x-5 = x^2',
                      '6'),
                     ('Решите уравнение (если корней несколько, запишите их сумму): x^3 - x = 0',
                      '0'),
                     (
                         'Решите уравнение (если корней несколько, запишите их сумму): √((2x-5)^2) = 1',
                         '5'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Когда я \n\
гляжу на трубящего ангела(1) написанного на западной арке продольной части храма(2) когда думаю об \n\
этом прекрасном образе(3) рожденном чувством гармонии(4) ясностью духа(5) плавной чистотой \n\
линий(6) и красок(7) то невольно воспринимаю встречу с чудом искусства(8) как встречу с самим \n\
творцом художественного совершенства.', '123457'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Мы редко \n\
замечаем (1) как прекрасна русская природа. В ней поражает всё (2) и бескрайние озёра (3) и \n\
душистые луга. Каждый звук здесь отзывается в сердце (4) летом (5) шелест берёз и многолетних \n\
дубов (6) зимой (7) похрустывание снега под ногами. Называя явления природы шедеврами (8) \n\
К.Г.Паустовский писал (9) «Разве не шедевр этот клик журавлей и их величавый перелёт по неизменным \n\
в течение многих тысячелетий воздушным дорогам?»', '249'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Некоторые \n\
уже улеглись на влажную(1) устланную осыпающейся хвоей(2) землю(3) жевали жёсткие солдатские \n\
сухари(4) копчёную колбасу(5) а кое-кто(6) открыв перочинным ножом жестяную банку(7) ел свиную \n\
тушёнку(8) намазывая её на тонко нарезанные(9) ломтики чёрствого хлеба.', '1345678'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: \n\
Невероятной кажется способность человека(1) который всю жизнь считал(2) что он aбсолютно \n\
неспособен к иностранным языкaм(3) но, попaв в чужую страну(4) в экстремальную ситуaцию(5) он \n\
быстро и легко выучивaет чужой язык(6) представлявшийся до этого(7) совершенно невозможным для \n\
запоминания.', '123456'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Сквозь (1) \n\
набиравшую всё большую силу (2) пургу я (3) напрягая зрение (4) старался разглядеть вдали \n\
маленький домик (5) который был засыпан снегом по самые окна так (6) что отыскать его среди (7) \n\
окружавших меня со всех сторон (8) сугробов представлялось задачей не просто трудной (9) но \n\
невозможной.', '34569'),
                     (
                         'Найдите значение выражения: 2,5*3,5 - 0,35 (Десятичная дробь записывается через точку!)',
                         '8.4'),
                     ('Значение какого из данных выражений положительно, если известно, что x > 0, y < 0? \
В ответе укажите номер правильного варианта.\n\
1)xy\n\
2)(x − y)yn\n\
3)(y − x)y\n\
4)(y − x)x', '3'),
                     ('Найдите значение выражения (√18 + √2) * √2', '8'),
                     ('Во время вероятностного эксперимента монету бросили 1000 раз, 532 раза выпал орел. На \n\
сколько частота выпадения решки в этом эксперименте отличается от вероятности этого события? (Десятичная дробь записывается через \n\
точку!)',
                      '0.032'),
                     ('Решите неравенство 6x - 7 < 8x - 9. В ответе укажите номер правильного варианта.\n\
1)(−∞;8)\n\
2)(−∞;1)\n\
3)(8;+∞)\n\
4)(1;+∞)', '4')],
          'Средняя': [('Решите уравнение (если корней несколько, запишите их сумму): x^4-2x^2 = \n\
-1', '0'),
                      ('Найдите значение выражения 16/(4a-a^2) - 4/a при a = -12 (Десятичная дробь \n\
записывается через точку!)', '0.25'),
                      ('Из 500 мониторов, поступивших в продажу, в среднем 15 не работают. \n\
                      Какова вероятность того, что случайно выбранный в магазине монитор \n\
работает? (Десятичная дробь записывается через точку!)', '0.97'),
                      ('Средняя норма потребляемой воды в классе, в котором учится Игорь, среди \n\
мальчиков составляет 2,5л. Игорь выпивает в день 2,3л воды. Какое из следующих утверждений верно?\n\
1)Обязательно найдется мальчик, который выпивает 2,6л в день.\n2)Все мальчики, кроме Игоря, \n\
выпивают в день по 2,5л воды.\n3)Обязательно найдется мальчик в классе, который пьет больше, чем \n\
2,5л в день.\n4)Обязательно найдется мальчик в классе, который выпивает ровно 2,5л в день.', 3),
                      ('Расстояние s (в метрах) до места удара молнии можно приближённо вычислить \n\
по формуле s=330t, где t — количество секунд, прошедших между вспышкой молнии и ударом грома. \n\
Определите, на каком расстоянии от места удара молнии находится наблюдатель, если t=10с. Ответ \n\
дайте в километрах, округлив его до целых.', '3'),
                      ('Напишите наибольшее целое число x, для которого истинно высказывание:\n\
НЕ (X <= 11) И НЕ (X >= 17).', '16'),
                      ('Напишите наибольшее целое число x, для которого истинно высказывание:\n\
НЕ (X <= 3) И НЕ (X >= 7).', '6'),
                      ('Напишите наибольшее натуральное число x, для которого ИСТИННО \n\
                      высказывание\n(x < 7) И НЕ (x < 6).', '6'),
                      ('Для каждого физического понятия подберите \n\
соответствующий пример. Запишите в таблицу выбранные цифры под соответствующими буквами.\n\
Пример записи: А1Б2В3\nПонятия: А)физическая величина, Б)единица физической величины, В)прибор для \n\
измерения физической величины\nПримеры: 1)ньютон, 2)инерция, 3)масса, 4)кристалл, 5)весы',
                       'А3Б1В5'),
                      ('Установите соответствие между физическими величинами и единицами измерения \n\
этих величин в системе СИ.\nПример записи: А1Б2В3\nВеличины: А)жесткость, Б)момент силы, В)вес\n\
Примеры: 1)килограмм, 2)ньютон, 3)ньютон-метр, 4)ньютон на метр, 5)джоуль', 'А4Б3В2'),
                      ('Для каждого физического понятия подберите \n\
соответствующий пример. Запишите в таблицу выбранные цифры под соответствующими буквами.\n\
Пример записи: А1Б2В3\nВеличины: А)вес тела, Б)работа силы, В)масса тела\nРазмерности: 1)кг, \
2)Дж, 3)Н, 4)м', 'А3Б2В1'),
                      ('Замените словосочетание «встретить с радостью», построенное на основе управления, синонимичным \n\
словосочетанием со связью примыкание. Напишите получившееся словосочетание.', 'радостно встретить'),
                      (
                          'Замените словосочетание «прилив моря», построенное на основе управления, синонимичным словосочетанием со \n\
    связью согласование.', 'морской прилив'),
                      (
                          'Замените словосочетание «гудок парохода», построенное на основе управления, синонимичным словосочетанием со \n\
    связью согласование. Напишите получившееся словосочетание.', 'пароходный гудок'),
                      (
                          'Замените словосочетание «дно колодца», построенное на основе управления, синонимичным словосочетанием со \n\
    связью согласование. Напишите получившееся словосочетание.', 'колодезное дно')],
          'Сложная': [
              ('Найдите значение выражения (a^2-49b^2)/(4a^2) * a/(4a-28b) при a=√175, b=√175', '0.5'),
              ('Укажите номера верных утверждений. 1)Если три стороны одного треугольника \n\
пропорциональны трём сторонам другого треугольника, то треугольники подобны.\n2)Сумма смежных углов равна 180°.\n\
3)Любая высота равнобедренного треугольника является его биссектрисой.\nЕсли \n\
утверждений несколько, запишите их номера в порядке возрастания.', '12'),
              ('Укажите номера верных утверждений. 1)Медиана равнобедренного \n\
треугольника, проведённая из вершины угла, противолежащего основанию, делит этот угол пополам.\n\
2)Не существует прямоугольника, диагонали которого взаимно перпендикулярны.\n\
3)В плоскости для точки, лежащей вне круга, расстояние до центра круга больше его радиуса.Если утверждений\n\
несколько, запишите их номера в порядке возрастания.', '13'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
Once there were four children whose names were Peter, Susan, Edmund and Lucy. This story happened to ______ (THEY)\n\
when they had to leave their home city, London, during the war.', 'them'),
              ('Преобразуйте слово, напечатанное заглавными буквами в\n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
«They ______ (SEND) to the house of an old Professor who lived in the country, ten miles from the nearest \n\
railway station.»', 'were sent'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом. \n\
For some reason British food does not have the best reputation in the world. A few years ago I asked a ______ (VISIT)\n\
to Britain about the local food.', 'visitor'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
He described it as tasteless and ______. (BORE)', 'boring'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
«... Are you hungry by the way? I ______(ORDER) some pizza. Will you join me?"»', 'have ordered'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
Indeed, even hardworking people need some _____________(ENTERTAIN) from time to time or they can get stressed out.',
               'entertainment'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
«Whatever your opinion of piranhas, this is a ______(USE) piece of advice one should follow.»',
               'useful'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)КОСТНЫЙ (мозг)— написание непроизносимой согласной в корне проверяется подбором однокоренного слова кость, в котором согласный \n\
звучит отчётливо.
\n2)НЕПРИГОДНЫЙ— НЕ пишется слитно с именем прилагательным, которое не употребляется без НЕ.
\n3)РАЗОБЩЁННЫЙ— в корне слова пишется непроверяемая гласная.
\n4)ЛИНОВАННАЯ (тетрадь)— написание НН в слове определяется наличием суффикса -ОВА-.
\n5)СТАЩИТЬ— на конце приставки перед буквой, обозначающей глухой согласный, пишется буква С.""", '14'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)ЗДРАВСТВУЙТЕ— Приставка неизменяемая.
\n2)КУРИНЫЙ (суп)— в суффиксе-ИН- отымённых прилагательных пишется одна -Н-.
\n3)ГОРЕТЬ— написание безударной чередующейся гласной в корне слова зависит от суффикса, который следует за корнем.
\n4)(стало) НЕВТЕРПЁЖ— на конце наречий после шипящего буква Ь не пишется.
\n5)(подойти к) КОМУ-ЛИБО— неопределённое местоимение пишется через дефис, потому что с суффиксом -ЛИБО- слова пишутся через дефис.""",
               '25'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)ПРИПЛЫТЬ— написание приставки определяется её значением— неполнота действия.
\n2)НИСХОДЯЩАЯ (линия)— в слове приставка НИС-, которая пишется всегда одинаково независимо от произношения.
\n3)ЗАГОРЕВШИЙ— в корне слова с чередующейся гласной без ударения пишется буква О.
\n4)ВИДЯТ— в форме настоящего времени 3-го лица множественного числа глагола II спряжения пишется окончание -ЯТ.
\n5)ВО ВРЕМЕНИ— в окончании формы предложного падежа имени существительного 3-го склонения пишется буква И.""",
               '34'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)(находиться) ЗДЕСЬ— на конце приставки перед буквой, обозначающей звонкий согласный звук, пишется буква З.
\n2)ВЕСЕННЕЕ (настроение)— в прилагательном, образованном от существительного с основой на -Н, с помощью суффикса -Н- пишется -НН- \n\
на стыке морфем.
\n3)ВЫСТИРАТЬ (бельё)— написание безударной чередующейся гласной в корне слова зависит от его лексического значения.
\n4)УЛЫБАЮЩИЙСЯ (человек)— в причастии, образованном от глагола I спряжения, пишется суффикс -ЮЩ-.
\n5)СУДОРЕМОНТНЫЙ (завод)— сложное существительное пишется слитно.""",
               '24'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов в порядке \n\
возрастания.\n
1)РАССТАВЛЯТЬ— на конце приставки перед буквой, обозначающей глухой согласный звук, пишется буква С.
\n2)РЕШЕНА (задача)— в краткой форме имени прилагательного пишется столько же Н, сколько и в полной форме этого прилагательного.
\n3)ПРИКАСАТЬСЯ— написание безударной чередующейся гласной в корне слова зависит от его лексического значения.
\n4)(устал от) НЕУДАЧ— в форме множественного числа имени существительного 3-го склонения после шипящего буква Ь не пишется.
\n5)(объяснялся) ПО-НЕМЕЦКИ— наречие пишется через дефис, потому что оно образовано от основы имени прилагательного при помощи \n\
приставки ПО- и суффикса -И.""", '15')]}

VIKT_Q = {
    1: 'Английский ученый-психолог Дэвид Льюис утверждает, что это безопасно лишь для женщин, тогда как для мужчин может стать\nисточником опасных болезней. Проведенные исследования показали, что лишь у четверти женщин наблюдались какие-либо\nнезначительные отклонения, например, сердцебиение. Мужчины же, наоборот, крайне отрицательно отреагировали\nна это: у них участился пульс, стала проявляться аритмия, резко подскочило кровяное давление.\nНазовите это английским словом, которое относительно недавно проникло и в русский язык.',
    2: 'Многие не верят в ее существование. Однако Кант считал, что с нее начинается любое человеческое знание. А еще говорят,\nчто она подводит только тех, у кого она есть. Назовите ее.',
    3: 'Один литературный персонаж, гуляя по зоопарку и проникшись сочувствием к запертым в клетках животным, решил, что некому\nслову очень бы не помешала приставка "не". Что это за слово?',
    4: 'Это вещество - основной компонент кислотных дождей. В газообразной форме оно может вызвать тяжелые ожоги. Последствием\nпопадания этого вещества в желудок может стать усиленное потоотделение, а в случае большой дозы - и рвота. При\nслучайном же вдыхании его не исключен и летальный исход. Назовите это вещество.',
    5: 'У африканской народности суахили есть легенда, повествующая о том, что первый человек спустился на землю с неба. А кто\nпомог ему это сделать?',
    6: 'Средства коммуникации находят отражение в мышлении. ДжАрлат РИган говорит, что на выступлении комика рыдал от смеха, как\nЭТО. Скотт ФАльман считает, что ЭТО уродливо и не дает возможности проявить творческое начало. Назовите ЭТО\nнесклоняемым словом.',
    7: 'В Чехии Новогоднее застолье не обходится без ливанцев. Мы не просим вас перевести это слово на русский язык. Назовите праздник, с которым ливанцы связаны у русских.',
    8: '1. Он неоднократно побеждал в составе сборной России по теннису.\n2. Его отцом был офицер-железнодорожник Лотарёв.\n3. Такой космодром находится в Российской Федерации.\n4. Так сейчас называется Ленинградский военный округ.\n5. На этот вокзал приходил в Париж экспресс из Санкт-Петербурга.\nКакое предложение здесь лишнее? (В ответе должна быть цифра)',
    9: 'Согласно одной из версий, название черноморского города, на месте которого когда-то стояла греческая колония, связано со\nсловом, которым местные жители называли двойные орехи. На гербе города можно увидеть шапки, каждая из\nкоторых напоминает половинку чудесного предмета. Какого именно?',
    10: 'Я не буду вас спрашивать, какой сюжет чаще всего экранизировался, назовите лишь фигурирующий в нем овощ.',
    11: 'В 1999 году в одну из лондонских больниц поступил пациент с сильным ожогом, полученным из-за его любопытства и\nнеосторожности. По форме ожога удалось определить время несчастного случая с точностью до нескольких минут.\nНазовите двумя словами событие, ставшее причиной получения ожога.',
    12: 'В самом начале биографического фильма еще молодой герой сидит в кресле у телевизора. С иронично повернутой набок\nголовой и кривой усмешкой он смотрит передачу о теории, противником которой станет в будущем. Назовите этого героя.',
    13: 'Героине одного скетча предлагают в аптеке ЕЕ в качестве отечественного теста на беременность — мол, вероятность\nправильности прогноза невысокая, зато дешево. ЕЕ действительно продают в аптеках как лекарственное средство.\nНазовите ЕЕ.',
    14: 'Согласно версии, приведенной в английской Википедии, своим появлением это выражение обязано военным рапортам, в\nкоторых сообщалось об отсутствии убитых. Напишите это выражение.',
    15: 'Слоган рекламы магазина товаров для мужчин гласил: "От ветровки до ОМЕГИ". Иногда ОМЕГУ называют Последним рубежом.\nНазовите ОМЕГУ.',
    16: 'Одной из причин уменьшения численности деревенских ласточек в современной Европе является ремонт дорог и вызванное\nим исчезновение АЛЬФ. В одной сказке мальчик щекотал АЛЬФУ палочкой, и мелкие круги покрывали ее\nдобродушную физиономию. Какое слово мы заменили словом "АЛЬФА"?',
    17: 'Вы видели Финляндию в белую ночь?\nПолуночного солнца печальную дочь?\nЭти сосны, седой тканью мха оплетенные?\nМожжевельника веточки темно-зеленые...\nОдин режиссер влюбился в девушку, которая мечтала стать актрисой, но проваливалась на прослушиваниях.\nОн сочинил стихотворение, которое вы видите перед собой, и испытание было пройдено.\nКем же была девушка? (В ответе прилагательное должно быть в Именительном падеже и женском роде)',
    18: 'Когда на Земле наступает астрономическая весна? (Запишите дату в формате ДД.ММ, прим.: 01.01; 12.10)',
    19: 'Как зовут Деда Мороза на Кипре? (Если есть полное имя – то укажите полное)',
    20: 'Что является основным приобретением японцев перед новогодними праздниками?',
    21: 'До указа Петра I Новый год на Руси отмечался именно в этот день. А в какой? (Запишите дату в формате\nДД.ММ, прим.: 01.01; 12.10)',
    22: 'Эта женщина в виде исключения дважды была лауреатом Нобелевской премии. Назовите ее. (Запишите ответ в\nформате Имя Фамилия)',
    23: 'На какой вопрос нельзя дать положительный ответ? (В конце добавьте знак вопроса)',
    24: 'Назовите полное имя почтальона из мультфильма "Трое из Простаквашино". (Запишите ответ в формате Имя Отчество Фамилия)',
    25: 'Сколько сердец у Осьминога? (Запишите ответ в виде числа)',
    26: 'Какой процент массы солнечной системы находится на Солнце с точностью до 1 процента? (Запишите ответ в виде числа)',
    27: 'Какая настольная игра состоит из 40 пространств, содержащих 28 объектов, четыре железных дороги, две коммунальные\nуслуги, три служебных помещения, три служебных сундука, пространство налога на роскошь,\nпространство подоходного налога и еще что-то?',
    28: 'Филолог Ольга Пузырева обращает внимание на корни слов "похудеть" и "поправиться" — мол, бороться с лишним весом\nсложно даже на лингвистическом уровне. Далее добавляется, что носителям английского языка тоже\nдо смерти неприятно некое слово. Напишите его.',
    29: 'Филандер, один из видов опоссума, получил название ТАКОЙ из-за наличия на мордочке двух пятен. Энциклопедия\n"Жизнь животных", вряд ли желая обидеть этого зверька, отмечает, что филандер похож на водяного опоссума,\nявляющегося отличным ныряльщиком. Какое двукоренное слово мы заменили словом "ТАКОЙ"?',
    30: 'Впервые ИКС был использован в фильме 1929 года "Женщина на Луне". В начале фильма "ИКС" секретный агент\nуспевает сообщить о взрыве, который прогремит через 48 часов. Назовите ИКС двумя словами, начинающимися\nна одну и ту же букву.',
    31: 'Какое прозвище из двух слов дали канадские комментаторы Екатерине Гамовой, регулярно завершающей атаки\nсвоей команды? (Ответ запишите, используя английскую расладку)',
    32: 'Запишите расшифровку "Т9" (Если нужно, можно использовать английскую раскладку)',
    33: 'Перед вами фрагмент изображения, появившегося в 2011 году в российском Интернете. Какое имя собственное из двух\nслов присутствует на этом изображении? (Ответ запишите без кавычек, каждое слово с\nбольшой буквы)',
    34: '(P.S. - ОТВЕТ ЯВЛЯЕТСЯ МЕМОМ) Кто ты – crewmate или imposter? А может...? (Ответ, если нужно, запишите с\nпомощью английской раскладки, начиная с большой буквы)',
    35: 'Как называется знак корня в алгебре?',
    36: 'Кто из животных спит с открытыми глазами: Звери, Птицы, Рыбы или Млекопитающие?',
    37: 'Что такое "виадук"? (Ответ должен состоять из одного слова)',
    38: 'Что такое "авиетка"? (Если есть прилагательное, то его записывать не нужно)',
    39: 'Орсон Уэллс рассказывал, что после паники, вызванной радиопостановкой "Война миров", к нему стали приходить\nугрожающие письма. Во время спектакля, где играл Уэллс, один из зрителей в первом ряду сунул\nруку во внутренний карман. Уэллс с ужасом уставился на него, но достал зритель вовсе не пистолет.\n"Я бы предпочел быть убитым", — говорил Уэллс. Что же достал зритель?',
    40: 'В 2002 году чемпионат России по этому виду спорту в четвертый раз прошел в городке Вятские Поляны. Назовите\nэтот вид спорта.',
    41: 'Владелец магазина из комедийного сериала, пессимист и мизантроп, разместил ЭТО на обеих сторонах. Напишите\nЭТО. (В ответе используйте наречие на русской раскладке)',
    42: 'В дореволюционной России после запрещения периодического издания его редакция обычно старалась основать\nдругой орган с тем же направлением, но, естественно, под другим названием. Один из исследователей\nпишет: ""Камский край" через месяц-другой воскресал как "Прикамский край", его сменял\n"Закамский край" и так далее, пока не иссякали денежные средства и не исчерпывались ОНИ".\nНазовите ИХ.',
    43: 'Андрей Зорин написал послесловие к книге Михаила Безродного "Конец цитаты". Название послесловия совпадает\nс известным предупреждением в одном из видов транспорта, в котором второе слово заменено\nсловом "кавычки". Напишите название послесловия. (В ответе используйте знаки препинания,\nесли они потребуются (в конце точку ставить не нужно))',
    44: 'Напишите слово, пропущенное в подписи к полученной вами карикатуре Виталия Подвицкого.',
    45: 'ПЕРВАЯ в первобытной культуре была всего лишь зарубкой, но совместно с нулем они, согласно Би-Би-Си, стали\nправить современным миром. Какое слово мы заменили на "ПЕРВАЯ"?',
    46: 'Когда был создан телеграм? (В ответе должна быть дата формата ДД.ММ.ГГГГ)',
    47: 'Как на Руси называли мелкие льдинки, плавающие на поверхности воды перед ледоставом?',
    48: 'Каким предметом китайцы стараются не пользоваться в преддверии Нового года, чтобы не разрушить счастья?',
    49: 'Из какого мяса традиционно готовится начинка для чебуреков?',
    50: 'Когда состоялся первый выпуск дискорда? (Ответ запишите в формате ДД.ММ) ',
    51: 'Сколько струн у балалайки?',
    52: 'Как называется память, предназначенная для ускорения обращения к данным в компьютере?',
    53: 'Из какого металла были сделаны ложки в недорогих советских столовых?',
    54: 'В 1994 году увидела свет "Энциклопедия экстремальных ситуаций". В статьи на букву "К" входят, например,\n"Кораблекрушение" и "Конец света", на букву "Ш" — "Шаровая молния". Назовите единственную\nстатью на "Э".',
    55: 'В 2011 году на спектакле в лондонском театре Barbican зрителям вместо кресел предлагались кровати, а\nзавершалась программа утренним завтраком. Как назывался спектакль?',
    56: 'Эта парижская улица существует с 1826 года и за последние 104 года сменила имя трижды. Ныне ей возвращено\nпервое название. Какое?',
    57: 'Длина Транссибирской магистрали 9 298 километров, она проходит через 87 городов, пересекает 16 крупных рек\nи 8 ИХ. Что мы зашифровали под словом ИХ?',
    58: 'Какая категория мест в самолете, считается наивысшей по уровню комфорта?',
    59: 'Какой автомобильный код использовался в СССР? (Ответ запишите в виде двух заглавных букв на английском языке)',
    60: 'Назовите родину волнистого попугая. (В ответе должна быть указана страна)',
    61: 'В халяльном ресторане автор вопроса с удивлением увидел ЕЁ для чаевых. Назовите ЕЁ.',
    62: 'Национальный девиз Швейцарии появился во второй половине 19 века. Девиз подчеркивает, что, несмотря на\nразделение страны на множество кантонов, если что-то случится, то каждый кантон будет\nподдерживать остальных. Назовите этот девиз.',
    63: 'В одной шутке о НЕЙ был оставлен такой отзыв: "Одна звезда. Не рекомендую". Назовите ЕЕ двумя словами на\nодну и ту же букву.',
    64: 'В 1943 появилась листовка, поздравлявшая Гитлера с днем рождения и желавшая, чтоб этот день рождения\nбыл... Каким? (Ответ запишите в форме Им.п., ед.ч., м.р.)',
    65: 'Во время приёмов в домах высокопоставленных лиц в Японии ширмы в прямом смысле помогали установить ЕЁ.\nНазовите ЕЁ двумя словами.',
    66: 'Памятник в городе Якутске изображает ЕЁ прекрасной девушкой с волнистыми волосами. Назовите ЕЁ.',
    67: 'В «Илиaде» очень подробно описаны многочисленные раны от копий, стрел и мечей. ГЭвин ФрЭнсис приводит\nтеорию, согласно которой ГомЕр был ИМ. Назовите ЕГО двумя словами, которые начинаются\nна одну и ту же букву.',
    68: 'В одном произведении рассказывается предыстория известного персонажа, который в детстве за свои злые\nпроказы получил прозвище Бессердечный. Однажды он залез в огромную гулкую посудину и с\nлязгом ходил по улицам родной деревни, притворившись, будто эта посудина живая.\nНазовите этого персонажа двумя словами.',
    69: 'Большое количество информации может храниться в мозгу из-за возможности по-разному комбинировать один\nи тот же набор нейронов. МарАт ЗигАнов сравнивает мозг с продукцией некой фирмы. Эту\nфирму основал человек, жена которого умерла, оставив его с четырьмя маленькими детьми.\nО какой фирме идёт речь? (Название нужно написать одним словом на английском, с большой буквы)',
    70: 'Воспроизведите надпись, которая была стёрта в левой верхней части этого рисунка.',
    71: 'В одном из роликов на своём ютУб-канале ОН складывал самолётики разного размера и сравнивал, какой из\nних дальше полетит. Напишите ЕГО фамилию, псевдоним или название канала. (В ответе\nзапишите только фамилию с большой буквы, на русскому языке)',
    72: ' В одном произведении описывается интернациональная команда, состоящая из Сергея, Сурена, Семёна и\nРаймонда. Какое название было выбрано для этой команды?'}

VIKT_A = {1: 'Шопинг', 2: 'Интуиция', 3: 'Вольер', 4: 'Вода', 5: 'Жираф', 6: 'Эмодзи',
           7: 'Масленица', 8: '2', 9: 'Яйцо', 10: 'Тыква', 11: 'Солнечное-затмение',
           12: 'Стивен-Хокинг', 13: 'Ромашка', 14: 'Ок', 15: 'Аляска', 16: 'Лужа', 17: 'Картавая',
           18: '21.03', 19: 'Василий', 20: 'Грабли', 21: '01.09', 22: 'Мария-Кюри', 23: 'Ты-спишь?',
           24: 'Игорь-Иванович-Печкин', 25: '3', 26: '99', 27: 'Монополия', 28: 'Диета',
           29: 'Четырехглазый', 30: 'Обратный-отсчет', 31: 'Game-over', 32: 'Text-on-9-keys',
           33: 'Единая-Россия', 34: 'Amogus', 35: 'Радикал', 36: 'Рыбы', 37: 'Мост', 38: 'Самолет',
           39: 'Часы', 40: 'Городки', 41: 'Закрыто', 42: 'Приставки',
           43: 'Осторожно,-кавычки-закрываются', 44: 'Собака', 45: 'Единица', 46: '14.08.2013',
           47: 'Сало', 48: 'Нож', 49: 'Баранина', 50: '13.05', 51: '3', 52: 'Кэш-память',
           53: 'Алюминий', 54: 'Экзамен', 55: 'Колыбельная', 56: 'Улица-Санкт-Петербурга',
           57: 'Часовые-пояса', 58: 'Первый-класс', 59: 'SU', 60: 'Австралия', 61: 'Свинья',
           62: 'Один-за-всех-и-все-за-одного', 63: 'Солнечная-система', 64: 'Последний',
           65: 'Социальная-дистанция', 66: 'Лена', 67: 'Военный-врач', 68: 'Железный-дровосек',
           69: 'Lego', 70: 'Finland', 71: 'Бумага', 72: 'СССР'}
VIKT_T = {
    1: 'С этим словом связано посещение магазинов (в большинстве - магазинов одежды). От такого же, но английского слова и образовано загаданное слово.',
    2: 'Отрывок из определения слова:\n*Способность, свойство человека понимать, формировать и проникать в смысл событий, ситуаций*.',
    3: 'Данное слово образовано от слова "Воля" и является огражденной забором площадкой.',
    4: 'Химическая формула вещества: Два атома водорода и один атом кислорода.',
    5: 'Загаданное слово является наименованием животного, которое имеет длинную шею.',
    6: 'Когда в переписке собеседник отправляет нам что-то смешное, мы можем отправить ему ЭТО. Расшифровкой ЭТОГО будет: смеюсь, не могу, слезы от смеха!',
    7: 'У нас ливанцы выступают символом Солнца, т.к. они круглые, желто-коричневые, а также их очень вкусно кушать со сгущенкой! :-). Чаще всего их едят на восьмой неделе перед Пасхой.',
    8: 'А везде ли в вопросах есть связь со сторонами света? Можешь проверить это!',
    9: 'Этот предмет можно кушать и готовить по-разному: сварить, пожарить или сварить вкрутую!',
    10: 'Серьезно? Ну ладно... Из этого овоща можно сделать зловещую мордочку.',
    11: 'В прошлом году произошло событие, которое могло повлечь за собой ожоги глаз. Следующее такое событие будет в 2039 году. Не пропусти!',
    12: 'Основная область исследований Героя - космология и квантовая гравитация. Ему принадлежит цитата:\nПерспектива рано умереть заставила меня понять, что жизнь стоит того, чтобы её прожить.',
    13: 'Этот предмет является цветком. На нем девочки любят гадать: "Любит или не любит"...',
    14: 'Самое частое слово, которое мы произносим вместо "Хорошо" на какую-то просьбу.',
    15: 'ОМЕГА - самый северный и самый крупный штат в США.',
    16: 'После дождя образуется на земле АЛЬФА. Так что же это?',
    17: 'Ты внимательно же читал стихотворение? И какой же буквы там нет?)',
    18: 'Это событие связано с положением Солнца (всего таких дней в году 4, а недавно было одно из них).',
    19: 'На Руси имя отмечено с приходом христианства из Византии.',
    20: 'Отрывок из определения предмета:\nСельскохозяйственный инструмент, применяемый для разбивания комьев уже разрыхлённой почвы, очистки от выкопанных корней сорных трав.',
    21: 'В году мы не один раз поздравляем с Новым годом, а когда еще, помимо Нового Года?',
    22: 'Удостоена Нобелевских премий по физике (1903) и по химии (1911), является первой женщиной — нобелевским лауреатом в истории и первым дважды нобелевским лауреатом в истории.',
    23: 'Этот вопрос можно задать в основном ночью.',
    24: 'Имя: "Слово о полку ИМЯ", Фамилию то вы должны знать... может, от слова "Печка", Отчество: "ОТЧЕСТВО Васильевич меняет профессию".',
    25: '11 сердцец (но это если в двоичной системе счисления!).',
    26: 'Это очень много... очень! Почти все!',
    27: 'В этой есть и собственный банкомат с долларами!',
    28: 'Это слово просто созвучно со словом "Die" [Дай] - умереть.',
    29: 'Не похожи ли те ДВА пятна на морде с чем-то другим на морде?',
    30: 'Данное словосочетание можно увидеть как "До стрима осталось ???", и каждую секунду что-то происходит. Как же все таки это называется?',
    31: 'Обычно данное словосочетание можно увидеть в играх при поражении или как знак окончания игры.',
    32: 'Что мы делаем на клавиатуре? Правильно, печатаем. На чем мы печатаем? Правильно, на клавишах. А вообще, вспомните кнопочный телефон. Сколько там цифр? (0 не в счет)',
    33: 'Попробуй прочитать слева направо. Мы видим "СИЯ", "ПАРТИЯ" и "Ж". Может, это какое-то высказывание политическое? И с чем оно связано? Интересно...',
    34: 'Какой пополурный мем был в этом году?',
    36: 'А у всех ли животных из списка есть веки? А для чего нужны веки? Вот и подумай)',
    37: 'Это строение. На нем ездят машины.',
    38: '"Ави"... Похоже, что-то связанное с воздухоплаванием?',
    39: 'Раньше были карманные ОНИ. А сейчас уже есть и настенные, наручные и даже электронные!',
    40: 'В самом вопросе есть слово, у которого если поменять окончание, то это и будет ответом!',
    41: 'В некоторых магазинах, например, ВкусВилл, есть таблички с надписями, отображающими в зависимости от времени работы магазина, в каком он состоянии. А какая же надпись была у нашего пессимистичного героя?',
    42: 'Не хотите сравнить слова "Камский", "Закамский" и "Прикамский". Чем они друг от друга отличаются? Может, разобрать их по морфемам?',
    43: 'Этот вид транспорта - метро. А что же там говорят при конце, т.к. при закрытии дверей?',
    44: 'Внимательно перечитайте адресную строку почты царя. Что там "неуместного"?',
    45: 'Современном миром правит электроника. Как мы знаем, она работает на "бИтах" - Единица и Ноль (1 и 0). А что из этого похоже на зарубок?',
    46: '2013 год) А дальше - думайте сами:)',
    47: 'Загаданное слово является твердым животным жиром.',
    48: 'Однако, мы его используем ежедневно, чтобы что-то разделать на более маленькие кусочки.',
    49: 'Популярное мясо наряду с говядиной, свининой и курицей.',
    50: 'Это случилось в 2015 году, за 2 дня до 80-летия московского метро.',
    52: 'В частности, в питоне использование декораторов для ЭТО-ирования очень сильно ускоряет работу программы.',
    53: 'Сейчас из этого материала делают всю посуду: от ложки до ножа, от сковородки до больших кастрюль. А сам он начинается на букву "А".',
    54: 'Данное слово связано со школой.',
    55: 'А вы заметили, как начался спектакль и как закончился? Может, он не такой уж и обычный, а убаюкивающий?',
    56: 'Три раза сменила название за 110 лет. А у нас есть город, который менял свое название 3 раза (Он до сих пор входит в состав России)!',
    57: 'Хм, а разве машина ехала и у нее было постоянно одно и то же время на часах?',
    63: 'А если рассматривать слово "звезда" не как оценку? А как космическое тело?..',
    65: 'Это словосочетание активно использовалось с 2020 года по февраль 2022 в Москве (из-за пандемии)',
    66: 'Присмотритесь на волосы женщины. Они вам ничего не напоминают? Очень похоже на дельту...',
    68: 'Вспомните "Изумрудный город" - кто там был без сердца и хотел его заполучить?',
    69: 'У нас в мозге очень много нейронов. А в продукции данной фирмы очень много деталей (мелких и крупных, которые сцепляются друг с другом).',
    72: 'Посмотрите на буквы имен. Особенно большие...'}


PHOTOS_VIKT = {33: 'https://db.chgk.info/images/db/20110698.jpg',
               44: 'https://db.chgk.info/images/db/20120289.jpg',
               56: 'https://wl-adme.cf.tsp.li/resize/728x/jpg/c11/461/f5e964512fb9c083b17264d0d2.jpg',
               57: 'https://wl-adme.cf.tsp.li/resize/728x/jpg/b8d/8ca/2e9e0e5e2695eda1aaa501ec99.jpg',
               66: 'https://db.chgk.info/sites/default/files/shkl6-2.png',
               70: 'https://db.chgk.info/sites/default/files/shkl6-3.png'}
