WORK_Q = {'Легкая': [('Решите уравнение (если корней несколько, запишите их сумму): x^2-2x+4 = 2x',
                      '2'),
                     ('Решите уравнение (если корней несколько, запишите их сумму): √x = 9', '81'),
                     ('Решите уравнение (если корней несколько, запишите их сумму): 6x-5 = x^2',
                      '6'),
                     ('Решите уравнение (если корней несколько, запишите их сумму): x^3 - x = 0',
                      '0'),
                     (
                         'Решите уравнение (если корней несколько, запишите их сумму): √((2x-5)^2) = 1',
                         '5'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Когда я \n\
гляжу на трубящего ангела(1) написанного на западной арке продольной части храма(2) когда думаю об \n\
этом прекрасном образе(3) рожденном чувством гармонии(4) ясностью духа(5) плавной чистотой \n\
линий(6) и красок(7) то невольно воспринимаю встречу с чудом искусства(8) как встречу с самим \n\
творцом художественного совершенства.', '123457'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Мы редко \n\
замечаем (1) как прекрасна русская природа. В ней поражает всё (2) и бескрайние озёра (3) и \n\
душистые луга. Каждый звук здесь отзывается в сердце (4) летом (5) шелест берёз и многолетних \n\
дубов (6) зимой (7) похрустывание снега под ногами. Называя явления природы шедеврами (8) \n\
К.Г.Паустовский писал (9) «Разве не шедевр этот клик журавлей и их величавый перелёт по неизменным \n\
в течение многих тысячелетий воздушным дорогам?»', '249'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Некоторые \n\
уже улеглись на влажную(1) устланную осыпающейся хвоей(2) землю(3) жевали жёсткие солдатские \n\
сухари(4) копчёную колбасу(5) а кое-кто(6) открыв перочинным ножом жестяную банку(7) ел свиную \n\
тушёнку(8) намазывая её на тонко нарезанные(9) ломтики чёрствого хлеба.', '1345678'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: \n\
Невероятной кажется способность человека(1) который всю жизнь считал(2) что он aбсолютно \n\
неспособен к иностранным языкaм(3) но, попaв в чужую страну(4) в экстремальную ситуaцию(5) он \n\
быстро и легко выучивaет чужой язык(6) представлявшийся до этого(7) совершенно невозможным для \n\
запоминания.', '123456'),
                     ('В ответ запишите цифры, на местах которых должны стоять запятые: Сквозь (1) \n\
набиравшую всё большую силу (2) пургу я (3) напрягая зрение (4) старался разглядеть вдали \n\
маленький домик (5) который был засыпан снегом по самые окна так (6) что отыскать его среди (7) \n\
окружавших меня со всех сторон (8) сугробов представлялось задачей не просто трудной (9) но \n\
невозможной.', '34569'),
                     (
                         'Найдите значение выражения: 2,5*3,5 - 0,35 (Десятичная дробь записывается через точку!)',
                         '8.4'),
                     ('Значение какого из данных выражений положительно, если известно, что x > 0, y < 0? \
В ответе укажите номер правильного варианта.\n\
1)xy\n\
2)(x − y)yn\n\
3)(y − x)y\n\
4)(y − x)x', '3'),
                     ('Найдите значение выражения (√18 + √2) * √2', '8'),
                     ('Во время вероятностного эксперимента монету бросили 1000 раз, 532 раза выпал орел. На \n\
сколько частота выпадения решки в этом эксперименте отличается от вероятности этого события? (Десятичная дробь записывается через \n\
точку!)',
                      '0.032'),
                     ('Решите неравенство 6x - 7 < 8x - 9. В ответе укажите номер правильного варианта.\n\
1)(−∞;8)\n\
2)(−∞;1)\n\
3)(8;+∞)\n\
4)(1;+∞)', '4')],
          'Средняя': [('Решите уравнение (если корней несколько, запишите их сумму): x^4-2x^2 = \n\
-1', '0'),
                      ('Найдите значение выражения 16/(4a-a^2) - 4/a при a = -12 (Десятичная дробь \n\
записывается через точку!)', '0.25'),
                      ('Из 500 мониторов, поступивших в продажу, в среднем 15 не работают. \n\
                      Какова вероятность того, что случайно выбранный в магазине монитор \n\
работает? (Десятичная дробь записывается через точку!)', '0.97'),
                      ('Средняя норма потребляемой воды в классе, в котором учится Игорь, среди \n\
мальчиков составляет 2,5л. Игорь выпивает в день 2,3л воды. Какое из следующих утверждений верно?\n\
1)Обязательно найдется мальчик, который выпивает 2,6л в день.\n2)Все мальчики, кроме Игоря, \n\
выпивают в день по 2,5л воды.\n3)Обязательно найдется мальчик в классе, который пьет больше, чем \n\
2,5л в день.\n4)Обязательно найдется мальчик в классе, который выпивает ровно 2,5л в день.', 3),
                      ('Расстояние s (в метрах) до места удара молнии можно приближённо вычислить \n\
по формуле s=330t, где t — количество секунд, прошедших между вспышкой молнии и ударом грома. \n\
Определите, на каком расстоянии от места удара молнии находится наблюдатель, если t=10с. Ответ \n\
дайте в километрах, округлив его до целых.', '3'),
                      ('Напишите наибольшее целое число x, для которого истинно высказывание:\n\
НЕ (X <= 11) И НЕ (X >= 17).', '16'),
                      ('Напишите наибольшее целое число x, для которого истинно высказывание:\n\
НЕ (X <= 3) И НЕ (X >= 7).', '6'),
                      ('Напишите наибольшее натуральное число x, для которого ИСТИННО \n\
                      высказывание\n(x < 7) И НЕ (x < 6).', '6'),
                      ('Для каждого физического понятия подберите \n\
соответствующий пример. Запишите в таблицу выбранные цифры под соответствующими буквами.\n\
Пример записи: А1Б2В3\nПонятия: А)физическая величина, Б)единица физической величины, В)прибор для \n\
измерения физической величины\nПримеры: 1)ньютон, 2)инерция, 3)масса, 4)кристалл, 5)весы',
                       'А3Б1В5'),
                      ('Установите соответствие между физическими величинами и единицами измерения \n\
этих величин в системе СИ.\nПример записи: А1Б2В3\nВеличины: А)жесткость, Б)момент силы, В)вес\n\
Примеры: 1)килограмм, 2)ньютон, 3)ньютон-метр, 4)ньютон на метр, 5)джоуль', 'А4Б3В2'),
                      ('Для каждого физического понятия подберите \n\
соответствующий пример. Запишите в таблицу выбранные цифры под соответствующими буквами.\n\
Пример записи: А1Б2В3\nВеличины: А)вес тела, Б)работа силы, В)масса тела\nРазмерности: 1)кг, \
2)Дж, 3)Н, 4)м', 'А3Б2В1'),
                      ('Замените словосочетание «встретить с радостью», построенное на основе управления, синонимичным \n\
словосочетанием со связью примыкание. Напишите получившееся словосочетание.', 'радостно встретить'),
                      (
                          'Замените словосочетание «прилив моря», построенное на основе управления, синонимичным словосочетанием со \n\
    связью согласование.', 'морской прилив'),
                      (
                          'Замените словосочетание «гудок парохода», построенное на основе управления, синонимичным словосочетанием со \n\
    связью согласование. Напишите получившееся словосочетание.', 'пароходный гудок'),
                      (
                          'Замените словосочетание «дно колодца», построенное на основе управления, синонимичным словосочетанием со \n\
    связью согласование. Напишите получившееся словосочетание.', 'колодезное дно')],
          'Сложная': [
              ('Найдите значение выражения (a^2-49b^2)/(4a^2) * a/(4a-28b) при a=√175, b=√175', '0.5'),
              ('Укажите номера верных утверждений. 1)Если три стороны одного треугольника \n\
пропорциональны трём сторонам другого треугольника, то треугольники подобны.\n2)Сумма смежных углов равна 180°.\n\
3)Любая высота равнобедренного треугольника является его биссектрисой.\nЕсли \n\
утверждений несколько, запишите их номера в порядке возрастания.', '12'),
              ('Укажите номера верных утверждений. 1)Медиана равнобедренного \
треугольника, проведённая из вершины угла, противолежащего основанию, делит этот угол пополам.\n\
2)Не существует прямоугольника, диагонали которого взаимно перпендикулярны.\n\
3)В плоскости для точки, лежащей вне круга, расстояние до центра круга больше его радиуса.Если утверждений\n\
несколько, запишите их номера в порядке возрастания.', '13'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
Once there were four children whose names were Peter, Susan, Edmund and Lucy. This story happened to ______ (THEY)\n\
when they had to leave their home city, London, during the war.', 'them'),
              ('Преобразуйте слово, напечатанное заглавными буквами в\n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
«They ______ (SEND) to the house of an old Professor who lived in the country, ten miles from the nearest \n\
railway station.»', 'were sent'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом. \n\
For some reason British food does not have the best reputation in the world. A few years ago I asked a ______ (VISIT)\n\
to Britain about the local food.', 'visitor'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
He described it as tasteless and ______. (BORE)', 'boring'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
«... Are you hungry by the way? I ______(ORDER) some pizza. Will you join me?"»', 'have ordered'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
Indeed, even hardworking people need some _____________(ENTERTAIN) from time to time or they can get stressed out.',
               'entertainment'),
              ('Преобразуйте слово, напечатанное заглавными буквами в \n\
скобках так, чтобы оно грамматически соответствовало содержанию текста. Заполните пропуск полученным словом.\n\
«Whatever your opinion of piranhas, this is a ______(USE) piece of advice one should follow.»',
               'useful'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)КОСТНЫЙ (мозг)— написание непроизносимой согласной в корне проверяется подбором однокоренного слова кость, в котором согласный \n\
звучит отчётливо.
\n2)НЕПРИГОДНЫЙ— НЕ пишется слитно с именем прилагательным, которое не употребляется без НЕ.
\n3)РАЗОБЩЁННЫЙ— в корне слова пишется непроверяемая гласная.
\n4)ЛИНОВАННАЯ (тетрадь)— написание НН в слове определяется наличием суффикса -ОВА-.
\n5)СТАЩИТЬ— на конце приставки перед буквой, обозначающей глухой согласный, пишется буква С.""", '14'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)ЗДРАВСТВУЙТЕ— Приставка неизменяемая.
\n2)КУРИНЫЙ (суп)— в суффиксе-ИН- отымённых прилагательных пишется одна -Н-.
\n3)ГОРЕТЬ— написание безударной чередующейся гласной в корне слова зависит от суффикса, который следует за корнем.
\n4)(стало) НЕВТЕРПЁЖ— на конце наречий после шипящего буква Ь не пишется.
\n5)(подойти к) КОМУ-ЛИБО— неопределённое местоимение пишется через дефис, потому что с суффиксом -ЛИБО- слова пишутся через дефис.""",
               '25'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)ПРИПЛЫТЬ— написание приставки определяется её значением— неполнота действия.
\n2)НИСХОДЯЩАЯ (линия)— в слове приставка НИС-, которая пишется всегда одинаково независимо от произношения.
\n3)ЗАГОРЕВШИЙ— в корне слова с чередующейся гласной без ударения пишется буква О.
\n4)ВИДЯТ— в форме настоящего времени 3-го лица множественного числа глагола II спряжения пишется окончание -ЯТ.
\n5)ВО ВРЕМЕНИ— в окончании формы предложного падежа имени существительного 3-го склонения пишется буква И.""",
               '34'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих \n\
ответов в порядке возрастания.\n
1)(находиться) ЗДЕСЬ— на конце приставки перед буквой, обозначающей звонкий согласный звук, пишется буква З.
\n2)ВЕСЕННЕЕ (настроение)— в прилагательном, образованном от существительного с основой на -Н, с помощью суффикса -Н- пишется -НН- \n\
на стыке морфем.
\n3)ВЫСТИРАТЬ (бельё)— написание безударной чередующейся гласной в корне слова зависит от его лексического значения.
\n4)УЛЫБАЮЩИЙСЯ (человек)— в причастии, образованном от глагола I спряжения, пишется суффикс -ЮЩ-.
\n5)СУДОРЕМОНТНЫЙ (завод)— сложное существительное пишется слитно.""",
               '24'),
              ("""Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов в порядке \n\
возрастания.\n
1)РАССТАВЛЯТЬ— на конце приставки перед буквой, обозначающей глухой согласный звук, пишется буква С.
\n2)РЕШЕНА (задача)— в краткой форме имени прилагательного пишется столько же Н, сколько и в полной форме этого прилагательного.
\n3)ПРИКАСАТЬСЯ— написание безударной чередующейся гласной в корне слова зависит от его лексического значения.
\n4)(устал от) НЕУДАЧ— в форме множественного числа имени существительного 3-го склонения после шипящего буква Ь не пишется.
\n5)(объяснялся) ПО-НЕМЕЦКИ— наречие пишется через дефис, потому что оно образовано от основы имени прилагательного при помощи \n\
приставки ПО- и суффикса -И.""", '15')]}
